index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-26 Mo 11:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Mathias Fleury's web page</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mathias Fleury" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Mathias Fleury's web page</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#h:research">1. Research</a>
<ul>
<li><a href="#h:sat-solver-framework">1.1. SAT Solver Framework&#xa0;&#xa0;&#xa0;<span class="tag"><span class="isasat">isasat</span>&#xa0;<span class="CDCL">CDCL</span></span></a></li>
<li><a href="#h:sat-solvers">1.2. SAT Solving&#xa0;&#xa0;&#xa0;<span class="tag"><span class="SAT">SAT</span></span></a></li>
<li><a href="#h:proofs">1.3. Proof Reconstruction</a></li>
</ul>
</li>
<li><a href="#h:software">2. Software&#xa0;&#xa0;&#xa0;<span class="tag"><span class="software">software</span>&#xa0;<span class="isasat">isasat</span></span></a></li>
<li><a href="#h:thesis">3. PhD Thesis&#xa0;&#xa0;&#xa0;<span class="tag"><span class="thesis">thesis</span></span></a></li>
<li><a href="#h:related-links">4. External links</a></li>
<li><a href="#h:academic-duties">5. Academic Duties</a>
<ul>
<li><a href="#h:academic-duties-2021">5.1. 2021</a></li>
<li><a href="#h:academic-duties-2020">5.2. 2020</a></li>
<li><a href="#h:academic-duties-2019">5.3. 2019</a></li>
</ul>
</li>
<li><a href="#h:other-projects">6. Other Projects</a>
<ul>
<li><a href="#org3a4bf90">6.1. Isabelle/emacs</a></li>
<li><a href="#org774c5de">6.2. veriT and SPASS</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
This webpage contains documents that I generated, like the
Isabelle documentation from my PhD thesis. This is the only way to
have links which survives changes in my affiliation.
</p>


<div id="outline-container-orgd7f9f54" class="outline-2">
<h2 id="h:research"><a id="orgd7f9f54"></a><span class="section-number-2">1</span> <a id="orge788684"></a>Research</h2>
<div class="outline-text-2" id="text-h:research">
</div>
<div id="outline-container-orga87aad3" class="outline-3">
<h3 id="h:sat-solver-framework"><a id="orga87aad3"></a><span class="section-number-3">1.1</span> SAT Solver Framework&#xa0;&#xa0;&#xa0;<span class="tag"><span class="isasat">isasat</span>&#xa0;<span class="CDCL">CDCL</span></span></h3>
<div class="outline-text-3" id="text-h:sat-solver-framework">
<p>
As part of my PhD thesis, I developed a framework to formalize SAT
solving. I still continue to expend it. It is not a very fast SAT
solver, but you are guaranteed that the answer is correct and that
there is no overflow happening internally that would compromise
correctness.
</p>

<p>
Please refer to <a href="./isasat/isasat.html">the IsaSAT page</a> for more details.
</p>
</div>
</div>
<div id="outline-container-orge5b5fe5" class="outline-3">
<h3 id="h:sat-solvers"><a id="orge5b5fe5"></a><span class="section-number-3">1.2</span> SAT Solving&#xa0;&#xa0;&#xa0;<span class="tag"><span class="SAT">SAT</span></span></h3>
<div class="outline-text-3" id="text-h:sat-solvers">
<p>
I work with Armin Biere on SAT solving. One (rather obvious, but never written
down before) result is that the standard minimization algorithm is complete in
the sense that it remove all redundant literals (see more details in our SAT'21
paper). The result comes from a completeness theorem on Horn clauses.
</p>

<p>
Other interests include:
</p>
<ul class="org-ul">
<li>parallel cube-and-conquer SAT solving with the SAT solver <a href="https://github.com/maximaximal/Paracooba">Paracooba</a>.</li>
<li>normal CDCL with our technique coined <b>shrinking</b> that reduces the size of
learned clauses without increasing their glue. The technique is orthogonal
to minimization. Shrinking shares the cache used for minimization.</li>
</ul>
</div>
</div>

<div id="outline-container-orgd8dd519" class="outline-3">
<h3 id="h:proofs"><a id="orgd8dd519"></a><span class="section-number-3">1.3</span> Proof Reconstruction</h3>
<div class="outline-text-3" id="text-h:proofs">
<p>
One very useful tool of the interactive theorem prover Isabelle is the
interaction with automatic theorem provers living outside. These tools come in two flavours:
</p>
<ul class="org-ul">
<li>Sledgehammer: what facts do I need to prove this goal?</li>
<li>The <code>smt</code>-tactic: let Isabelle check the proof you found for this goal!</li>
</ul>

<p>
I worked on integrated <a href="https://verit.loria.fr/">veriT</a> into Sledgehammer during my master thesis, but I am
now mostly focusing on the second approach. I have extended the tactic to
include the SMT solver veriT and I am now working on integrating the SMT solver
cvc5 &#x2013; and unlike the work to integrate the Z3 in Isabelle by <a href="https://www21.in.tum.de/~boehmes/">Böhme</a>, the
authors of cvc5 (especially <a href="https://homepages.dcc.ufmg.br/~hbarbosa/">Barbosa</a> and Lachnitt) and veriT (especially <a href="https://schurr.io/about.html">Schurr</a>)
are helping me to make the proofs nicer and the reconstruction work easier!
</p>

<p>
In this direction, several people (including me) are attempting to define a
proof format tentatively called Alethe that makes reconstruction easy enough.
</p>
</div>
</div>
</div>

<div id="outline-container-org43ca900" class="outline-2">
<h2 id="h:software"><a id="org43ca900"></a><span class="section-number-2">2</span> <a id="org8e7fa73"></a>Software&#xa0;&#xa0;&#xa0;<span class="tag"><span class="software">software</span>&#xa0;<span class="isasat">isasat</span></span></h2>
<div class="outline-text-2" id="text-h:software">
<p>
See <a href="./src/sources.html">./src/sources.html</a>.
</p>
</div>
</div>
<div id="outline-container-orgb7b49d4" class="outline-2">
<h2 id="h:thesis"><a id="orgb7b49d4"></a><span class="section-number-2">3</span> PhD Thesis&#xa0;&#xa0;&#xa0;<span class="tag"><span class="thesis">thesis</span></span></h2>
<div class="outline-text-2" id="text-h:thesis">
<p>
My thesis comes with some fancy Isabelle documentation
<a href="https://m-fleury.github.io/thesis/doc/Weidenbach_Book/index.html">available here</a> and it would be too bad for the
links to get lost. The documentation refers to the <code>fleury-thesis</code> branch of IsaFoL available at
<a href="https://bitbucket.org/isafol/isafol/wiki/Home">https://bitbucket.org/isafol/isafol/wiki/Home</a>
</p>
</div>
</div>

<div id="outline-container-orga72d5e2" class="outline-2">
<h2 id="h:related-links"><a id="orga72d5e2"></a><span class="section-number-2">4</span> External links</h2>
<div class="outline-text-2" id="text-h:related-links">
<p>
My current webpage can be found at <a href="http://fmv.jku.at/fleury/index.html">http://fmv.jku.at/fleury/index.html</a>. This
page might or might not be more up-to-date than this one.
</p>
</div>
</div>
<div id="outline-container-orgc67d534" class="outline-2">
<h2 id="h:academic-duties"><a id="orgc67d534"></a><span class="section-number-2">5</span> Academic Duties</h2>
<div class="outline-text-2" id="text-h:academic-duties">
</div>
<div id="outline-container-org256a567" class="outline-3">
<h3 id="h:academic-duties-2021"><a id="org256a567"></a><span class="section-number-3">5.1</span> 2021</h3>
<div class="outline-text-3" id="text-h:academic-duties-2021">
<ul class="org-ul">
<li>Co-chair of <a href="http://pxtp.gitlab.io/2021/">PxTP 2021, Seventh Workshop on Proof eXchange for Theorem Proving</a></li>
<li>PC of <a href="https://pdar-workshop.github.io/workshop/">PDAR-21, Parallel and Distributed Automated Reasoning 2021</a></li>
<li>PC of <a href="http://i-cav.org/2021/organization/">CAV 2021-Artifact Evaluation, 33rd International Conference on Computer-Aided Verification</a></li>
<li>PC of <a href="https://etaps.org/2021/tacas"> Artefact Evaluation, 27th International Conference on Tools and Algorithms for the Construction and Analysis of Systems</a></li>
</ul>
</div>
</div>
<div id="outline-container-org9a0657c" class="outline-3">
<h3 id="h:academic-duties-2020"><a id="org9a0657c"></a><span class="section-number-3">5.2</span> 2020</h3>
<div class="outline-text-3" id="text-h:academic-duties-2020">
<ul class="org-ul">
<li>PC of <a href="https://tap.sosy-lab.org/2020/">TAP 20- Artefact Evaluation, 14th International Conference on Tests and Proofs 20</a></li>
<li>PC of <a href="https://popl20.sigplan.org/committee/VMCAI-2020-papers-artifact-evaluation-committee">VMCAI-20 - Artefact Evaluation, 21st International Conference on Verification, Model Checking, and Abstract Interpretation</a></li>
</ul>
</div>
</div>
<div id="outline-container-org7e92490" class="outline-3">
<h3 id="h:academic-duties-2019"><a id="org7e92490"></a><span class="section-number-3">5.3</span> 2019</h3>
<div class="outline-text-3" id="text-h:academic-duties-2019">
<ul class="org-ul">
<li>PC of <a href="http://pxtp.gforge.inria.fr/2019/">PxTP 2019, Seventh Workshop on Proof eXchange for Theorem Proving</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org632205f" class="outline-2">
<h2 id="h:other-projects"><a id="org632205f"></a><span class="section-number-2">6</span> Other Projects</h2>
<div class="outline-text-2" id="text-h:other-projects">
</div>
<div id="outline-container-org3a4bf90" class="outline-3">
<h3 id="org3a4bf90"><a id="isabelle-emacs"></a><span class="section-number-3">6.1</span> Isabelle/emacs</h3>
<div class="outline-text-3" id="text-6-1">
<p>
I work in my free time on Isabelle-emacs available at
<a href="https://github.com/m-fleury/isabelle-emacs/">https://github.com/m-fleury/isabelle-emacs/</a>. It slightly extends Isabelle's LSP
server (no change is done to Isabelle's kernel nor to Isabelle/jEdit) and make
Isabelle usable for Emacs. If you don't like Isabelle/jEdit or find it unstable
and unusable, this provides an alternative.
</p>
</div>
</div>
<div id="outline-container-org774c5de" class="outline-3">
<h3 id="org774c5de"><a id="veriT"></a><span class="section-number-3">6.2</span> veriT and SPASS</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Sometimes I try to implement some SAT techniques into the SAT solvers
<a href="https://verit.loria.fr/">veriT</a> and SPASS-SAT used in the SMT solver <a href="https://www.mpi-inf.mpg.de/departments/automation-of-logic/software/spass-workbench/spass-satt">SPASS-SATT</a></p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mathias Fleury</p>
<p class="date">Created: 2021-07-26 Mo 11:05</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
